IRP/src/Enums/IntegrationType/IntegrationType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>IntegrationType</name>
 <enumValues>
  <name>Other</name>
 </enumValues>
 <enumValues>
  <name>CurrencyRates</name>
 </enumValues>
 <enumValues>
  <name>FileStorage</name>
 </enumValues>
 <enumValues>
  <name>LocalFileStorage</name>
 </enumValues>
 <enumValues>
  <name>Email</name>
 </enumValues>
 <enumValues>
  <name>ClientBank</name>
 </enumValues>
 <enumValues>
  <name>SMSProvider</name>
 </enumValues>
 <enumValues>
  <name>Equipment</name>
 </enumValues>
 <enumValues>
  <name>VisitorCounter</name>
 </enumValues>
 <enumValues>
  <name>AccountingService</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/IntegrationSettings/IntegrationSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>IntegrationSettings</name>
  <attributes>
    <name>ExternalDataProc</name>
    <type>
      <types>CatalogRef.ExternalDataProc</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalDataProcSettings</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>IntegrationType</name>
    <type>
      <types>EnumRef.IntegrationType</types>
    </type>
  </attributes>
  <attributes>
    <name>StoreInSecureStorage</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ConnectionSetting</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>CatalogRef.IntegrationSettings</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Hide</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ConnectionSettingTest</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>CatalogRef.IntegrationSettings</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Hide</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/CommonForms/AttachFile/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Owner = Parameters.Owner;
	DefaultFilesStorageVolume = Constants.DefaultFilesStorageVolume.Get();
	FileList.Parameters.SetParameterValue("Owner", Owner);
EndProcedure

&AtClient
Procedure UploadDrag(Item, DragParameters, StandardProcessing)
	StandardProcessing = False;
	FileArray = New Array();
	If TypeOf(DragParameters.Value) = Type("Array") Then
		FileArray = DragParameters.Value;
	Else
		FileArray.Add(DragParameters.Value);
	EndIf;
	UploadFiles(FileArray);
EndProcedure

&AtClient
Procedure UploadDragCheck(Item, DragParameters, StandardProcessing)
	StandardProcessing = False;
EndProcedure

&AtClient
Async Procedure UploadFiles(FileArray)
	UserNotify = New Array();
	FilesToTransfer = New Array;
	For Each FileRef In FileArray Do
		If Not Await FileRef.File.IsDirectoryAsync() Then
			Size = FileRef.Size();
			byteSize = 1024;
			Size = Format(Size / (byteSize * byteSize), "NFD=3;");
			UserNotify.Add(FileRef.Name + " ( " + Size + "Mb )");
			FilesToTransfer.Add(FileRef);
		EndIf;
	EndDo;
	QueryText = StrTemplate(R().QuestionToUser_022, StrConcat(UserNotify, Chars.LF));
	If Await DoQueryBoxAsync(QueryText, QuestionDialogMode.OKCancel) = DialogReturnCode.OK Then
		AttachFileToOwner(FilesToTransfer);
	EndIf;
EndProcedure

&AtClient
Async Procedure AttachFileToOwner(FileIDs)
	FilesAtServer = Await PutFilesToServerAsync( , , FileIDs, UUID);	
	StrParam = New Structure("Ref, UUID", Owner, UUID);
	For Each File In FilesAtServer Do
		PictureViewerClient.AddFile(File, DefaultFilesStorageVolume, StrParam);
	EndDo;
	NotifyChanged(Type("InformationRegisterRecordKey.AttachedFiles"));
EndProcedure

&AtClient
Procedure DownloadFile(Command)
	If Items.FileList.CurrentData = Undefined Then
		Return;
	EndIf;
	PictureParameters = CreatePictureParameters(Items.FileList.CurrentData.File);
	PictureURL = PictureViewerClient.GetPictureURL(PictureParameters);
	GetFileFromServerAsync(PictureURL, PictureParameters.Description, New GetFilesDialogParameters());
EndProcedure

&AtServer
Function CreatePictureParameters(File)
	PictureParameters = New Structure();
	PictureParameters.Insert("Ref", File.Ref);
	PictureParameters.Insert("Description", File.Description);
	PictureParameters.Insert("FileID", File.FileID);
	PictureParameters.Insert("isFilledVolume", File.Volume <> Catalogs.IntegrationSettings.EmptyRef());
	PictureParameters.Insert("GETIntegrationSettings", File.Volume.GETIntegrationSettings);
	PictureParameters.Insert("isLocalPictureURL", File.Volume.GETIntegrationSettings.IntegrationType
		= Enums.IntegrationType.LocalFileStorage);
	PictureParameters.Insert("URI", File.URI);

	Return PictureParameters;
EndFunction
